[
  {
    "name":"Alexander the Great",
    "full_name":"Alexander",
    "period":"(356-323 BC)",
    "country":"Greece",
    "description":"Alexander III of Macedon (20/21 July 356 BC – 10/11 June 323 BC), commonly known as Alexander the Great (Greek: Ἀλέξανδρος ὁ Μέγας, Aléxandros ho Mégas Koine Greek: [a.lék.san.dros ho mé.gas] ), was a king (basileus) of the Ancient Greek kingdom of Macedon[a] and a member of the Argead dynasty. Born in Pella in 356 BC, Alexander succeeded his father, Philip II, to the throne at the age of twenty. He spent most of his ruling years on an unprecedented military campaign through Asia and northeast Africa, and by the age of thirty he had created one of the largest empires of the ancient world, stretching from Greece to northwestern India. He was undefeated in battle and is widely considered one of history\\'s most successful military commanders. During his youth, Alexander was tutored by the philosopher Aristotle until the age of 16. After Philip\\'s assassination in 336 BC, Alexander succeeded his father to the throne and inherited a strong kingdom and an experienced army. Alexander was awarded the generalship of Greece and used this authority to launch his father\\'s Panhellenic project to lead the Greeks in the conquest of Persia. In 334 BC, he invaded the Achaemenid Empire, and began a series of campaigns that lasted ten years. Following the conquest of Asia Minor, Alexander broke the power of Persia in a series of decisive battles, most notably the battles of Issus and Gaugamela. He subsequently overthrew the Persian King Darius III and conquered the Achaemenid Empire in its entirety. At that point, his empire stretched from the Adriatic Sea to the Indus River.Seeking to reach the \\\"ends of the world and the Great Outer Sea\\\", he invaded India in 326 BC, but eventually turned back at the demand of his homesick troops. Alexander died in Babylon in 323 BC, the city he planned to establish as his capital, without executing a series of planned campaigns that would have begun with an invasion of Arabia. In the years following his death, a series of civil wars tore his empire apart, resulting in several states ruled by the Diadochi, Alexander\\'s surviving generals and heirs.Alexander\\'s legacy includes the cultural diffusion his conquests engendered, such as Greco-Buddhism. He founded some twenty cities that bore his name, most notably Alexandria in Egypt. Alexander\\'s settlement of Greek colonists and the resulting spread of Greek culture in the east resulted in a new Hellenistic civilization, aspects of which were still evident in the traditions of the Byzantine Empire in the mid-15th century and the presence of Greek speakers in central and far eastern Anatolia until the 1920s. Alexander became legendary as a classical hero in the mold of Achilles, and he features prominently in the history and mythic traditions of both Greek and non-Greek cultures. He became the measure against which military leaders compared themselves, and military academies throughout the world still teach his tactics. He is often ranked among the most influential people in human history, along with his teacher Aristotle.",
    "references":"https://en.wikipedia.org/wiki/Alexander_the_Great",
    "keys":"Conqueror, The Great, Wars",
    "bookmark":0,
    "excerpt":"Alex the great",
    "image":"alexander"
  },
  {
    "name":"Abraham Lincoln",
    "full_name":"Abraham Lincoln",
    "period":"(1809-1865)",
    "country":"United States of America",
    "description":"\t \t Abraham Lincoln (February 12, 1809 – April 15, 1865) was an American politician and lawyer who served as the 16th President of the United States from March 1861 until his assassination in April 1865. Lincoln led the United States through its Civil War—its bloodiest war and perhaps its greatest moral, constitutional, and political crisis. In doing so, he preserved the Union, abolished slavery, strengthened the federal government, and modernized the economy. Born in Hodgenville, Kentucky, Lincoln grew up on the western frontier in Kentucky and Indiana. Largely self-educated, he became a lawyer in Illinois, a Whig Party leader, and was elected to the Illinois House of Representatives, in which he served for eight years. Elected to the United States House of Representatives in 1846, Lincoln promoted rapid modernization of the economy through banks, tariffs, and railroads. Because he had originally agreed not to run for a second term in Congress, and because his opposition to the Mexican–American War was unpopular among Illinois voters, Lincoln returned to Springfield and resumed his successful law practice. Reentering politics in 1854, he became a leader in building the new Republican Party, which had a statewide majority in Illinois. In 1858, while taking part in a series of highly publicized debates with his opponent and rival, Democrat Stephen A. Douglas, Lincoln spoke out against the expansion of slavery, but lost the U.S. Senate race to Douglas. In 1860, Lincoln secured the Republican Party presidential nomination as a moderate from a swing state. Though he gained very little support in the slaveholding states of the South, he swept the North and was elected president in 1860. Lincoln\'s victory prompted seven southern slave states to form the Confederate States of America before he moved into the White House - no compromise or reconciliation was found regarding slavery and secession. Subsequently, on April 12, 1861, a Confederate attack on Fort Sumter inspired the North to enthusiastically rally behind the Union. As the leader of the moderate faction of the Republican Party, Lincoln confronted Radical Republicans, who demanded harsher treatment of the South, War Democrats, who called for more compromise, anti-war Democrats (called Copperheads), who despised him, and irreconcilable secessionists, who plotted his assassination. Politically, Lincoln fought back by pitting his opponents against each other, by carefully planned political patronage, and by appealing to the American people with his powers of oratory. His Gettysburg Address became an iconic endorsement of the principles of nationalism, republicanism, equal rights, liberty, and democracy. Lincoln initially concentrated on the military and political dimensions of the war. His primary goal was to reunite the nation. He suspended habeas corpus, leading to the controversial ex parte Merryman decision, and he averted potential British intervention in the war by defusing the Trent Affair in late 1861. Lincoln closely supervised the war effort, especially the selection of top generals, including his most successful general, Ulysses S. Grant. He also made major decisions on Union war strategy, including a naval blockade that shut down the South\'s normal trade, moves to take control of Kentucky and Tennessee, and using gunboats to gain control of the southern river system. Lincoln tried repeatedly to capture the Confederate capital at Richmond; each time a general failed, Lincoln substituted another, until finally Grant succeeded. As the war progressed, his complex moves toward ending slavery included the Emancipation Proclamation of 1863; Lincoln used the U.S. Army to protect escaped slaves, encouraged the border states to outlaw slavery, and pushed through Congress the Thirteenth Amendment to the United States Constitution, which permanently outlawed slavery. An exceptionally astute politician deeply involved with power issues in each state, Lincoln reached out to the War Democrats and managed his own re-election campaign in the 1864 presidential election. Anticipating the war\'s conclusion, Lincoln pushed a moderate view of Reconstruction, seeking to reunite the nation speedily through a policy of generous reconciliation in the face of lingering and bitter divisiveness. On April 14, 1865, five days after the April 9th surrender of Confederate commanding general Robert E. Lee, Lincoln was assassinated by John Wilkes Booth, a Confederate sympathizer. Lincoln has been consistently ranked both by scholars and the public as among the three greatest U.S. presidents.",
    "references":"https://en.wikipedia.org/wiki/Abraham_Lincoln",
    "keys":"",
    "bookmark":0,
    "excerpt":"",
    "image":"abraham_lincoln"
  },
  {
    "name":"Fidel Castro",
    "full_name":"Fidel Alejandro Castro Ruz",
    "period":"(1926-2016)",
    "country":"Cuba",
    "description":"Fidel Alejandro Castro Ruz (August 13, 1926 &ndash; November 25, 2016) was a Cuban politician and revolutionary who governed the Republic of Cuba as Prime Minister from 1959 to 1976 and then as President from 1976 to 2008. Politically a Marxist&ndash;Leninist and Cuban nationalist, he also served as the First Secretary of the Communist Party of Cuba from 1961 until 2011. Under his administration, Cuba became a one-party socialist state; industry and business were nationalized, and state socialist reforms were implemented throughout society. Born in Bir&aacute;n, Oriente as the son of a wealthy Spanish farmer, Castro adopted leftist anti-imperialist politics while studying law at the University of Havana. After participating in rebellions against right-wing governments in the Dominican Republic and Colombia, he planned the overthrow of Cuban President Fulgencio Batista, launching a failed attack on the Moncada Barracks in 1953. After a year\'s imprisonment, he traveled to Mexico where he formed a revolutionary group, the 26th of July Movement, with his brother Ra&uacute;l Castro and Che Guevara. Returning to Cuba, Castro took a key role in the Cuban Revolution by leading the Movement in a guerrilla war against Batista\'s forces from the Sierra Maestra. After Batista\'s overthrow in 1959, Castro assumed military and political power as Cuba\'s Prime Minister. The United States came to oppose Castro\'s government, and unsuccessfully attempted to remove him by assassination, economic blockade, and counter-revolution, including the Bay of Pigs Invasion of 1961. Countering these threats, Castro formed an alliance with the Soviet Union and allowed the Soviets to place nuclear weapons on Cuba, sparking the Cuban Missile Crisis&mdash;a defining incident of the Cold War&mdash;in 1962. Adopting a Marxist-Leninist model of development, Castro converted Cuba into a one-party, socialist state under Communist Party rule, the first in the Western Hemisphere. Policies introducing central economic planning and expanding healthcare and education were accompanied by state control of the press and the suppression of internal dissent. Abroad, Castro supported anti-imperialist revolutionary groups, backing the establishment of Marxist governments in Chile, Nicaragua, and Grenada, and sending troops to aid allies in the Yom Kippur War, Ogaden War, and Angolan Civil War. These actions, coupled with Castro\'s leadership of the Non-Aligned Movement from 1979 to 1983 and Cuba\'s medical internationalism, increased Cuba\'s profile on the world stage. Following the Soviet Union\'s dissolution in 1991, Castro led Cuba into its &quot;Special Period&quot; and embraced environmentalist and anti-globalization ideas. In the 2000s he forged alliances in the Latin American &quot;pink tide&quot;&mdash;namely with Hugo Ch&aacute;vez\'s Venezuela&mdash;and signed Cuba to the Bolivarian Alliance for the Americas. In 2006 he transferred his responsibilities to Vice-President Ra&uacute;l Castro, who was elected to the presidency by the National Assembly in 2008. Castro is a polarizing world figure. His supporters laud him as a champion of socialism and anti-imperialism whose revolutionary regime advanced economic and social justice while securing Cuba\'s independence from American imperialism. Critics view him as a dictator whose administration oversaw human-rights abuses, the exodus of a large number of Cubans, and the impoverishment of the country\'s economy. Castro has been decorated with various international awards. Through his actions and writings, he has significantly influenced the politics of various individuals and groups across the world.",
    "references":"https://en.wikipedia.org/wiki/Fidel_Castro",
    "keys":"Cuban revolution",
    "bookmark":0,
    "excerpt":"",
    "image":"fidel_castro"
  },
  {
    "name":"John F. Kennedy",
    "full_name":"John Fitzgerald Kennedy",
    "period":"(1917-1963)",
    "country":"",
    "description":"John Fitzgerald Kennedy (May 29, 1917 - November 22, 1963), commonly referred to by his initials JFK, was an American politician who served as the 35th President of the United States from January 1961 until his assassination in November 1963. The Cuban Missile Crisis, the Bay of Pigs Invasion, the Nuclear Test Ban Treaty, the establishment of the Peace Corps, developments in the Space Race, the building of the Berlin Wall, the Trade Expansion Act to lower tariffs, and the Civil Rights Movement all took place during his presidency. A member of the Democratic Party, his New Frontier domestic program was largely enacted as a memorial to him after his death. Kennedy's time in office was marked by high tensions with Communist states. He increased the number of American military advisers in South Vietnam by a factor of 18 over Eisenhower. In Cuba, a failed attempt was made at the Bay of Pigs to overthrow the country's dictator Fidel Castro in April 1961. He subsequently rejected plans by the Joint Chiefs of Staff to orchestrate false-flag attacks on American soil in order to gain public approval for a war against Cuba. In October 1962, it was discovered Soviet ballistic missiles had been deployed in Cuba; the resulting period of unease, termed the Cuban Missile Crisis, is seen by many historians as the closest the human race has ever come to nuclear war between nuclear armed belligerents. After military service in the United States Naval Reserve in World War II, Kennedy represented Massachusetts's 11th congressional district in the U.S. House of Representatives from 1947 to 1953. He was elected subsequently to the U.S. Senate and served as the junior Senator from Massachusetts from 1953 until 1960. Kennedy defeated Vice President, and Republican candidate, Richard Nixon in the 1960 U.S. Presidential Election. At age 43, he became the youngest elected president and the second-youngest president (after Theodore Roosevelt, who was 42 when he became president after the assassination of William McKinley). Kennedy was also the first person born in the 20th century to serve as president. To date, Kennedy has been the only Roman Catholic president and the only president to have won a Pulitzer Prize (for his biography Profiles in Courage). Kennedy was assassinated in Dallas, Texas, on November 22, 1963. Lee Harvey Oswald was arrested that afternoon and determined to have fired shots that hit the President from a sixth floor window of the Texas School Book Depository. Dallas nightclub owner Jack Ruby fatally shot Oswald two days later in a jail corridor. The FBI and the Warren Commission officially concluded that Oswald was the lone assassin, but its report was sharply criticized. The United States House Select Committee on Assassinations (HSCA) agreed that Oswald fired the shots that killed the president, but also concluded that Kennedy was likely assassinated as the result of a conspiracy. The majority of Americans alive at the time of the assassination (52% to 29%), and continuing through 2013 (61% to 30%), believed that there was a conspiracy and that Oswald was not the only shooter. Since the 1960s, information concerning Kennedy's private life has come to light, including his health problems and allegations of infidelity. Kennedy continues to rank highly in historians' polls of U.S. presidents and with the general public. His average approval rating of 70% is the highest of any president in Gallup's history of systematically measuring job approval.",
    "references":"https://en.wikipedia.org/wiki/John_F._Kennedy",
    "keys":"Assasination, Presindent of USA",
    "bookmark":0,
    "excerpt":"",
    "image":"john_f_kennedy"
  },
  {
    "name":"Mahatma Gandhi",
    "full_name":"Mohan Das Karamchand Gandhi",
    "period":"(1869-1948)",
    "country":"India",
    "description":"",
    "references":"",
    "keys":"Freedom fighter, Dandi march, Salt satyagraha",
    "bookmark":0,
    "excerpt":"",
    "image":"mahatma_gandhi"
  },
  {
    "name":"Margaret Thatcher",
    "full_name":"",
    "period":"(1925-2013)",
    "country":"",
    "description":"",
    "references":"",
    "keys":"",
    "bookmark":0,
    "excerpt":"",
    "image":"margaret_thatcher"
  },
  {
    "name":"Marilyn Monroe",
    "full_name":"",
    "period":"(1926-1962)",
    "country":"",
    "description":"",
    "references":"",
    "keys":"",
    "bookmark":0,
    "excerpt":"",
    "image":"marilyn_monroe"
  },
  {
    "name":"Martin Luther King Jr.",
    "full_name":"",
    "period":"(1929-1968)",
    "country":"",
    "description":"",
    "references":"",
    "keys":"",
    "bookmark":0,
    "excerpt":"",
    "image":"martin_luther_king_jr"
  }
]